{
  "title": "work <span>experience</span>",
  "subtitle": "Take a look at my previous experiences",
  "job1_desc": "Joined a senior engineering team to develop a mobile app using React Native and TypeScript. Initially connected to a REST backend (via Axios) and later transitioned to GraphQL during a major revamp. Implemented Redux for state management and migrated the monorepo from Lerna to Nx for improved scalability. Built the new website from scratch with Next.js and contributed to rapid internal tools using Retool. Actively wrote unit tests with Jest and React Native Testing Library. Collaborated closely with PMs and stakeholders, reviewed merge requests, and maintained strong documentation in Notion. Features were gated with Split.io and tracked via Amplitude. Delivered clean, well-tested, and scalable frontend code in a fast-paced Agile team.",
  "job2_desc": "Acted as one of the lead senior frontend developers in Puzzle’s core engineering team. Built an internal admin platform in React to manage people, projects, and integrate with ClickUp for workflows and time tracking. Developed React Native apps focused on educational content—users watched videos, took surveys, and earned rewards. Also worked on a banking mobile app using React Native and TypeScript. Integrated an iOS SDK via a Swift bridge, and ensured quality with unit testing (Jest), E2E testing (Detox), and Storybook. Used GraphQL for all data interactions and Styled Components for theming and UI consistency. Worked closely with PMs, stakeholders, and designers. Heavily involved in feature planning, documentation, and technical decision-making across the projects.",
  "job3_desc": "Led the development of both web and mobile platforms for a client-facing solution. Built the website with React, using Redux for state management, and created the mobile app with React Native and Expo, initially using Redux then switching to MobX. Designed and implemented UI with Material UI (web) and Kitten UI (mobile). Utilized Storybook for component isolation in the mobile app. Managed the entire project lifecycle independently. Gained hands-on experience in backend tasks using Node.js, Express, and MongoDB. Worked in an Agile team with Git for version control.",
  "job4_desc": "Handled full-cycle software development independently, from gathering requirements and proposing UX improvements, to graphic design, implementation, testing, and deployment. Delivered websites using various CMSs (WordPress, Drupal) and developed custom apps with React and React Native. Focused on responsive and cross-browser compatibility. Also worked on custom C# desktop apps for doctors and restaurants, including MySQL integration, ticket printing, and Excel import/export. Technologies included SASS, Compass, LESS, Bootstrap, HTML5, CSS3, PHP, and JQuery.",
  "job5_desc": "Worked as Frontend Lead on a large-scale web application project for Deloitte. Built UI components with AngularJS and styled interfaces using HTML, CSS, SASS, Compass, Bootstrap, and Kendo UI. Managed a team and oversaw development tasks and code quality. Mentored backend engineers through a dedicated UI training course. Collaborated in Agile teams and used TFS for version control.",
  "job6_desc": "Worked on accessible web development projects for major clients like Isuzu and Brisbane City Council. Built websites, EDMs, HTML5 banners, and AngularJS applications using HTML, CSS, SASS, LESS, JQuery, GSAP, Bootstrap, and Drupal CMS. Ensured content met accessibility standards (tested with NVDA). Managed and maintained sites, contributed to UI enhancements, and participated in QA and Selenium testing. Used Git and SVN for version control and adhered to Agile workflows.",
  "job7_desc": "Worked as a Full Stack developer, building and designing a web application using Ruby on Rails, HTML, HAML, CSS, SASS, JQuery, Javascript, Bootstrap, MySQL and PostgreSQL. Also using GIT as a version control system and deploying the application on Heroku.",
  "job8_desc": "Set up WordPress multisite, resolved issues on existing sites, and performed maintenance. Technologies: PHP, HTML, CSS, WordPress.",
  "job9_desc": "I led web development projects, building responsive Drupal and WordPress sites for various departments. I designed UIs for public-facing apps, including the city’s Wi-Fi portal and a QR-based location tool using Google Maps. I collaborated with designers, handled plugin development, optimized UX, and ensured accessibility. I also worked on a Java/Spring-based system for internal use.",
  "job10_desc": "Performing network administrator tasks, such as supporting and maintaining the school’s networks. In addition to this I was in charge of selecting and updating the suitable software for the “Conectar Igualdad” program in School 728 – Alfonsina Storni, in the city of Puerto Madryn, Chubut, Argentina.",
  "skills_title": "Skills"
}
