{
  "uni": "Università Nacional del Sur",
  "uni_desc": "Mi sono diplomato e Laureato in Informatica.",
  "school": "Scuola di Formazione Tecnica Nº1 “Fray Luis Beltrán”",
  "school_desc": "Una volta terminata la scuola, ho conseguito la qualifica di: Tecnico Informatico Personale e Professionale.",
  "react": "React e React Native",
  "react_desc": "Ho studiato diversi corsi online per imparare React e React Native",
  "wordpress_course": "Corso Base di Wordpress",
  "wordpress_course_desc": "Ho impartito un corso base di Wordpress a Consaca, in Colombia.",
  "css_course": "Corso di CSS e Javascript",
  "css_course_desc": "Ho impartito un corso per sviluppatori BE presso Globant, insegnando gli strumenti e le tecnologie utilizzate nello sviluppo FE.",
  "ux_masterclass": "Corso base di UX",
  "ux_masterclass_desc": "Corso di base di UX a Brisbane, Australia",
  "scipycon": "Intelligenza artificiale con Python - SciPyCon 2013",
  "scipycon_desc": "Un corso sull'intelligenza artificiale presso l'Università San Juan Bosco in Puerto Madryn, Argentina",
  "free_digital": "Per una società digitale libera - Di Richard Stallman",
  "free_digital_desc": "Ho assistito a una conferenza tenuta dal famoso Richard Stallman a Bahia Blanca",
  "security": "Sicurezza informatica: problemi, strumenti, tecniche e metodi di lavoro",
  "security_desc": "Si tratta di una conferenza tenuta da Leonardo de Matteis presso l'UNS",
  "joomla": "JOOMLA, il tuo sito web dalla sera alla mattina",
  "joomla_desc": "Un corso introduttivo allo sviluppo di temi Joomla e alla gestione di questo CMS",
  "gnu_linux": "Corso introduttivo al sistema operativo GNU/Linux",
  "gnu_linux_desc": "Un seminario con i concetti di base per l'utilizzo di Linux",
  "spa": "Spagnolo",
  "spa_desc": "Lingua Madre",
  "eng": "Inglese",
  "eng_desc": "Ho studiato per 6 anni presso la “Asociación Argentina de Cultura Inglesa” (1995 - 2001). Ho sostenuto l'esame TOEFL IBT nel gennaio 2014 con un punteggio di 86. Ho anche vissuto per un anno in Australia.",
  "ita": "Italiano",
  "ita_desc": "Fluente. Vivo a Salerno, dal 2022"
}
