{
  "uni": "Università Nacional del Sur",
  "uni_desc": "Ho conseguito la Laurea in Scienze Informatiche, acquisendo solide conoscenze teoriche e pratiche nello sviluppo software, strutture dati, algoritmi, intelligenza artificiale e sistemi distribuiti.",
  "school": "Scuola di Formazione Tecnica Nº1 “Fray Luis Beltrán”",
  "school_desc": "Diplomato come Tecnico in Informatica Personale e Professionale, un percorso focalizzato su programmazione di base, hardware, reti e supporto tecnico.",
  "react": "React e React Native",
  "react_desc": "Ho seguito diversi corsi online su React e React Native, imparando a costruire applicazioni moderne sia per il web che per dispositivi mobili.",
  "wordpress_course": "Corso Base di Wordpress",
  "wordpress_course_desc": "Ho tenuto un corso introduttivo su WordPress, insegnando come creare e personalizzare siti web utilizzando questo CMS.",
  "css_course": "Corso di HTML, CSS e Javascript",
  "css_course_desc": "Ho condotto un corso per sviluppatori backend presso Globant, introducendo tecniche e strumenti moderni di sviluppo front-end.",
  "ux_masterclass": "Corso base di UX",
  "ux_masterclass_desc": "Ho partecipato a un corso base di UX, concentrandomi sulla progettazione centrata sull’utente, wireframes e usabilità.",
  "scipycon": "Intelligenza artificiale con Python - SciPyCon 2013",
  "scipycon_desc": "Ho frequentato un corso presso l'Universidá San Juan Bosco in cui sono state esplorate le tecniche di intelligenza artificiale utilizzando Python.",
  "free_digital": "Per una società digitale libera - Di Richard Stallman",
  "free_digital_desc": "Ho assistito a una conferenza di Richard Stallman a Bahía Blanca sui diritti digitali, software libero e il progetto GNU.",
  "security": "Sicurezza informatica: problemi, strumenti, tecniche e metodi di lavoro",
  "security_desc": "Conferenza tecnica su strumenti, tecniche e metodologie per la protezione dei sistemi informatici contro minacce moderne.",
  "joomla": "JOOMLA, il tuo sito web dalla sera alla mattina",
  "joomla_desc": "Corso introduttivo su Joomla come CMS, comprendente installazione, personalizzazione dei temi e gestione dei contenuti.",
  "gnu_linux": "Corso introduttivo al sistema operativo GNU/Linux",
  "gnu_linux_desc": "Sessione base sull’uso di GNU/Linux, comandi fondamentali, struttura delle cartelle e filosofia open source.",
  "spa": "Spagnolo",
  "spa_desc": "Lingua Madre",
  "eng": "Inglese",
  "eng_desc": "Ho studiato per 6 anni presso la “Asociación Argentina de Cultura Inglesa” (1995 - 2001). Ho sostenuto l'esame TOEFL IBT nel gennaio 2014 con un punteggio di 86. Ho anche vissuto per un anno in Australia.",
  "ita": "Italiano",
  "ita_desc": "Fluente. Vivo a Salerno, dal 2022"
}
