{
  "title": "esperienza <span>lavorativa</span>",
  "subtitle": "Potete consultare i miei lavori precedenti",
  "job1_desc": "Sono entrato a far parte di un team di ingegneri senior per sviluppare un'applicazione mobile utilizzando React Native e TypeScript. Inizialmente collegata a un backend REST (tramite Axios), è passata in seguito a GraphQL durante un revamp. Abbiamo implementato Redux per la gestione degli stati e migrato il monorepo da Lerna a Nx per migliorare la scalabilità. Ho costruito il nuovo sito web da zero con Next.js e ho contribuito a strumenti interni utilizzando Retool. Ho scritto attivamente test unitari con Jest e la libreria di test React Native. Ho collaborato a stretto contatto con i PM e le parti interessate, ho esaminato le merge request e ho mantenuto una solida documentazione in Notion. Le funzionalità sono state gestite con Split.io e monitorate tramite Amplitude. Ho consegnato codice frontend pulito, ben testato e scalabile in un team Agile.",
  "job2_desc": "Sono stato uno dei principali sviluppatori senior di frontend nel team di ingegneri di Puzzle. Ho contribuito allo sviluppo di una piattaforma di amministrazione interna in React per gestire persone e progetti e integrarsi con ClickUp per i flussi di lavoro e il monitoraggio delle ore. Ho sviluppato un'applicazione React Native focalizzata su contenuti educativi: gli utenti guardavano video, facevano sondaggi e guadagnavano premi. Ho lavorato anche a un'applicazione mobile per il settore bancario utilizzando React Native e TypeScript. Abbiamo integrato un SDK iOS tramite un bridge Swift e garantito la qualità con test unitari (Jest), test E2E (Detox) e Storybook. Ho utilizzato GraphQL per tutte le interazioni con i dati e Styled Components per la tematizzazione e la coerenza dell'interfaccia utente. Ho lavorato a stretto contatto con PM, stakeholder e designer. Fortemente coinvolto nella pianificazione delle funzionalità, nella documentazione e nel processo decisionale tecnico dei progetti.",
  "job3_desc": "Ho guidato lo sviluppo delle piattaforme web e mobile. Ho realizzato il sito web con React, utilizzando Redux per la gestione degli stati, e ho creato l'applicazione mobile con React Native ed Expo, utilizzando inizialmente Redux e passando poi a MobX. Progettato e implementato l'interfaccia utente con Material UI (web) e Kitten UI (mobile). Ho utilizzato Storybook per l'isolamento dei componenti nell'applicazione mobile. Ho gestito l'intero ciclo di vita del progetto in modo indipendente. Ho acquisito esperienza pratica nelle attività di backend utilizzando Node.js, Express e MongoDB. Ho lavorato in un team Agile con Git per il controllo delle versioni.",
  "job4_desc": "Ho gestito in modo indipendente l'intero ciclo di sviluppo del software, dalla raccolta dei requisiti e dalla proposta di miglioramenti UX, alla progettazione grafica, all'implementazione, ai test e alla distribuzione. Ho realizzato siti web utilizzando vari CMS (WordPress, Drupal) e sviluppato applicazioni personalizzate con React e React Native. Mi sono concentrato sulla compatibilità responsive e cross-browser. Ho lavorato anche su applicazioni desktop personalizzate in C# per medici e ristoranti, tra cui l'integrazione di MySQL, la stampa di biglietti e l'importazione/esportazione di Excel. Le tecnologie utilizzate comprendono SASS, Compass, LESS, Bootstrap, HTML5, CSS3, PHP e JQuery.",
  "job5_desc": "Ho lavorato come Frontend Lead in un progetto di applicazione web su larga scala per Deloitte. Ho costruito componenti dell'interfaccia utente con AngularJS e ho creato interfacce di stile utilizzando HTML, CSS, SASS, Compass, Bootstrap e Kendo UI. Ho gestito un team e supervisionato le attività di sviluppo e la qualità del codice. Ho fatto da mentore agli ingegneri backend attraverso un corso di formazione dedicato all'interfaccia utente. Ho collaborato in team Agile e ho utilizzato TFS per il controllo delle versioni.",
  "job6_desc": "Ho lavorato a progetti di sviluppo web accessibili per clienti importanti come Isuzu e Brisbane City Council. Ho realizzato siti web, EDM, banner HTML5 e applicazioni AngularJS utilizzando HTML, CSS, SASS, LESS, JQuery, GSAP, Bootstrap e Drupal CMS. Mi sono assicurato che i contenuti fossero conformi agli standard di accessibilità (testati con NVDA). Ho gestito e mantenuto i siti, ho contribuito ai miglioramenti dell'interfaccia utente e ho partecipato ai test QA e Selenium. Ho utilizzato Git e SVN per il controllo delle versioni e ho aderito ai flussi di lavoro Agile.",
  "job7_desc": "Ho lavorato come sviluppatore Full Stack, costruendo e progettando un'applicazione web utilizzando Ruby on Rails, HTML, HAML, CSS, SASS, JQuery, Javascript, Bootstrap, MySQL e PostgreSQL.Utilizzando anche GIT come sistema di controllo delle versioni e distribuendo l'applicazione su Heroku.",
  "job8_desc": "Ho configurato WordPress multisito, risolto problemi su siti esistenti ed eseguito la manutenzione.Tecnologie: PHP, HTML, CSS, WordPress.",
  "job9_desc": "Ho diretto progetti di sviluppo web, realizzando siti responsive in Drupal e WordPress per vari dipartimenti. Ho progettato interfacce utente per applicazioni rivolte al pubblico, tra cui il portale Wi-Fi della città e uno strumento di localizzazione basato su QR che utilizza Google Maps.Ho collaborato con i designer, gestito lo sviluppo di plugin, ottimizzato la UX e garantito l'accessibilità. Ho lavorato anche a un sistema basato su Java/Spring per uso interno.",
  "job10_desc": "Ho svolto compiti di Net Administrator, come il supporto e la manutenzione delle reti scolastiche. Inoltre, mi sono occupato della selezione e dell'aggiornamento del software adatto al programma “Conectar Igualdad” nella scuola 728 - Alfonsina Storni, nella città di Puerto Madryn, Chubut, Argentina.",
  "skills_title": "Competenze"
}
