{
  "uni": "Universidad Nacional del Sur",
  "uni_desc": "Obtuve el título de Licenciado en Ciencias de la Computación, una formación académica sólida que me brindó las bases teóricas y prácticas necesarias para el desarrollo de software, algoritmos, estructuras de datos, inteligencia artificial y sistemas distribuidos.",
  "school": "Escuela de Educacion Tecnica Nº1 “Fray Luis Beltrán”",
  "school_desc": "Me gradué como Técnico en Computación Personal y Profesional, una carrera orientada a la formación práctica en mantenimiento de hardware, redes, programación básica y soporte técnico.",
  "react": "React y React Native",
  "react_desc": "Completé diversos cursos en línea enfocados en el ecosistema de React y React Native, abarcando desde los fundamentos hasta la creación de aplicaciones complejas para web y dispositivos móviles.",
  "wordpress_course": "Curso Basico de Wordpress",
  "wordpress_course_desc": "Tuve la oportunidad de dictar un curso introductorio sobre WordPress, enseñando a crear y personalizar sitios web utilizando este CMS, con enfoque práctico para emprendedores y principiantes.",
  "css_course": "Curso de HTML, CSS y Javascript",
  "css_course_desc": "Diseñé y dicté un curso interno para desarrolladores back-end en Globant, enfocado en buenas prácticas y herramientas modernas del desarrollo front-end utilizando HTML, CSS moderno y JavaScript.",
  "ux_masterclass": "Curso basico de UX",
  "ux_masterclass_desc": "Participé en un curso de introducción al diseño UX centrado en el usuario, donde aprendí conceptos clave sobre arquitectura de la información, wireframes y principios de diseño intuitivo.",
  "scipycon": "Inteligencia Artificial con Python - SciPyCon 2013",
  "scipycon_desc": "Asistí a una clase en la Universidad Nacional de la Patagonia San Juan Bosco donde se exploraron técnicas de IA usando Python.",
  "free_digital": "Por una sociedad digital libre - Por Richard Stallman",
  "free_digital_desc": "Presencié una inspiradora conferencia de Richard Stallman en Bahía Blanca sobre software libre, ética digital y el movimiento GNU.",
  "security": "Seguridad Computacional: problemas, herramientas, tecnicas y metodos de trabajo",
  "security_desc": "Asistí a una charla técnica sobre seguridad informática, donde se abordaron herramientas y metodologías actuales para mitigar vulnerabilidades y proteger sistemas.",
  "joomla": "JOOMLA, tu website de la noche a la mañana",
  "joomla_desc": "Curso introductorio que cubrió el manejo de Joomla como CMS, incluyendo instalación, personalización de plantillas y administración de contenidos.",
  "gnu_linux": "Curso introductorio al sistema operativo GNU / Linux",
  "gnu_linux_desc": "Charla orientada a usuarios nuevos, donde se enseñaron fundamentos del sistema GNU/Linux, terminal, estructura de archivos y filosofía open source.",
  "spa": "Español",
  "spa_desc": "Lengua Madre",
  "eng": "Ingles",
  "eng_desc": "Estudie 6 años en la “Asociación Argentina de Cultura Inglesa” (1995 - 2001), donde obtuve una nota final de 6. Rendi el examen TOEFL IBT en Enero de 2014 con una nota de 86. Tambien vivi por un año en Australia",
  "ita": "Italiano",
  "ita_desc": "Fluido. Vivo en Salerno, Italia desde el 2022"
}
