{
  "uni": "Universidad Nacional del Sur",
  "uni_desc": "Me recibi y obtuve un diploma de Licenciado en Ciencias de la Computacion",
  "school": "Escuela de Educacion Tecnica Nº1 “Fray Luis Beltrán”",
  "school_desc": "Cuando termine la escuela, obtuve un titulo terciario: Tecnico en Computacion Personal y Profesional",
  "react": "React y React Native",
  "react_desc": "Estudie diversos cursos online para aprender React y React Native",
  "wordpress_course": "Curso Basico de Wordpress",
  "wordpress_course_desc": "Dicte un curso de Wordpress basico en Consaca, Colombia.",
  "css_course": "Curso de CSS y Javascript",
  "css_course_desc": "Dicte un curso para desarrolladores BE en Globant enseñando las herramientas y tecnologias usadas en el desarrollo FE.",
  "ux_masterclass": "Curso basico de UX",
  "ux_masterclass_desc": "Tome un curso de UX basico en Brisbane",
  "scipycon": "Inteligencia Artificial con Python - SciPyCon 2013",
  "scipycon_desc": "Una clase en la universidad San Juan Bosco sobre AI",
  "free_digital": "Por una sociedad digital libre - Por Richard Stallman",
  "free_digital_desc": "Asisti a una charla dictada por el famoso Richard Stallman en Bahia Blanca",
  "security": "Seguridad Computacional: problemas, herramientas, tecnicas y metodos de trabajo",
  "security_desc": "Esta fue una charla dicatda por el Lic. Leonardo de Matteis en la UNS",
  "joomla": "JOOMLA, tu website de la noche a la mañana",
  "joomla_desc": "Un curso introductorio para le desarrollo de temas en Joomla y como manejar este CMS.",
  "gnu_linux": "Curso introductorio al sistema operativo GNU / Linux",
  "gnu_linux_desc": "Se trato de una charla con conceptos basicos para el uso de linux",
  "spa": "Español",
  "spa_desc": "Lengua Madre",
  "eng": "Ingles",
  "eng_desc": "Estudie 6 años en la “Asociación Argentina de Cultura Inglesa” (1995 - 2001). Obtuve una nota final de 6. Rendi el examen TOEFL IBT en Enero de 2014 con una nota de 86. Tambien vivi por un año en Australia",
  "ita": "Italiano",
  "ita_desc": "Fluido. Vivo en Salerno, Italia desde el 2022"
}
