{
  "title": "experiencia <span>laboral</span>",
  "subtitle": "Conocé mi experiencia laboral previa",
  "job1_desc": "Me uní a un equipo de ingenieros senior para desarrollar una aplicación móvil con React Native y TypeScript. Inicialmente conectado a un backend REST (a través de Axios) y más tarde se mudo a GraphQL durante una revamp. Usamos Redux para la gestión de estados y migramos el monorepo de Lerna a Nx para mejorar la escalabilidad. Construí el nuevo sitio web desde cero con Next.js y contribuí a herramientas internas usando Retool. Activamente escribí pruebas unitarias con Jest y React Native Testing Library. Colaboré estrechamente con PMs y partes interesadas, revisé merge requests, y mantuve una fuerte documentación en Notion. Las nuevas características fueron implementadas usando Split.io para su lanzamiento gradual y para las métricas se usó Amplitude. Entregué código frontend prolijo, bien probado y escalable en un equipo Agile.",
  "job2_desc": "Actué como uno de los principales desarrolladores Frontend senior en el equipo de ingeniería central de Puzzle. Construí una plataforma de administración interna en React para gestionar personas, proyectos e integrarla con ClickUp para flujos de trabajo y seguimiento del tiempo. Desarrollé aplicaciones React Native centradas en contenido educativo: los usuarios veían vídeos, hacían encuestas y ganaban recompensas. También trabajé en una aplicación móvil bancaria utilizando React Native y TypeScript. Integré un SDK de iOS a través de un bridge en Swift y aseguré la calidad con pruebas unitarias (Jest), pruebas E2E (Detox) y Storybook. Se utilizó GraphQL para todas las interacciones de datos y Styled Components para la tematización y la coherencia de la interfaz de usuario. Trabajé en estrecha colaboración con PMs, stackeholders y diseñadores. Muy involucrado en la planificación de características, documentación y toma de decisiones técnicas en todos los proyectos.",
  "job3_desc": "Dirigí el desarrollo de plataformas web y móviles para una solución orientada al cliente. Construí el sitio web con React, utilizando Redux para la gestión de estados, y creé la aplicación móvil con React Native y Expo, inicialmente utilizando Redux y luego cambiando a MobX. Para la interfaz de usuario se utilizó Material UI (web) y Kitten UI (móvil). Se usó Storybook para organizar los componentes en la aplicación móvil. Gestioné todo el ciclo de vida del proyecto de forma independiente. Hice experiencia práctica en tareas de backend con Node.js, Express y MongoDB. Trabajé en un equipo ágil con Git para el control de versiones.",
  "job4_desc": "Manejé el ciclo completo de desarrollo de software de forma independiente, desde la recopilación de requisitos y la propuesta de mejoras de UX, hasta el diseño gráfico, la implementación, las pruebas y el deploy. Entregué sitios web utilizando varios CMS (WordPress, Drupal) y desarrollé aplicaciones personalizadas con React y React Native. Centrado en la compatibilidad responsive y cross-browser. También trabajé en aplicaciones de escritorio personalizadas en C# para médicos y restaurantes, incluyendo integración con MySQL, impresión de tickets e importación/exportación de Excel. Tecnologías incluidas SASS, Compass, LESS, Bootstrap, HTML5, CSS3, PHP y JQuery.",
  "job5_desc": "Trabajé como Frontend Lead en un proyecto de aplicación web a gran escala para Deloitte. Construí componentes de interfaz de usuario con AngularJS y estilicé interfaces usando HTML, CSS, SASS, Compass, Bootstrap y Kendo UI. Gestioné un equipo y supervisé las tareas de desarrollo y la calidad del código. Fui mentor de ingenieros backend a través de un curso de formación dedicado a UI. Colaboré en equipos ágiles y usamos TFS para el control de versiones.",
  "job6_desc": "Trabajé en proyectos de desarrollo web accesible para clientes importantes como Isuzu y Brisbane City Council. Construí sitios web, EDMs, banners HTML5, y aplicaciones AngularJS usando HTML, CSS, SASS, LESS, JQuery, GSAP, Bootstrap, y Drupal CMS. Me aseguré que el contenido cumpliera con los estándares de accesibilidad (probado con NVDA). Administré y mantuve sitios web, contribuí a las mejoras de interfaz de usuario, y participé en el control de calidad y pruebas con Selenium. Utilizé Git y SVN para el control de versiones y trabajamos usando una metodlogía Agile.",
  "job7_desc": "Trabajé como desarrollador Full Stack, construyendo y diseñando una aplicación web usando Ruby on Rails, HTML, HAML, CSS, SASS, JQuery, Javascript, Bootstrap, MySQL y PostgreSQL. También usando GIT como sistema de control de versiones y desplegando la aplicación en Heroku.",
  "job8_desc": "Configuré un WordPress multisitio, verifique y resolví problemas en sitios existentes. También realizé tareas de mantenimiento. Tecnologías: PHP, HTML, CSS, WordPress.",
  "job9_desc": "Dirigí proyectos de desarrollo web, creando sitios responsivos en Drupal y WordPress para varios departamentos. Diseñé interfaces de usuario para aplicaciones de cara al público, incluido el portal Wi-Fi de la ciudad y una herramienta de localización basada en QR que utiliza Google Maps. Colaboré con diseñadores, me encargué del desarrollo de plugins, optimicé la experiencia del usuario y aseguré la accesibilidad. También trabajé en un sistema basado en Java/Spring para uso interno.",
  "job10_desc": "Realicé tareas de administrador de redes, como soporte y mantenimiento de las redes de la escuela. Además estuve a cargo de la selección y actualización del software adecuado para el programa «Conectar Igualdad» en la Escuela 728 - Alfonsina Storni, de la ciudad de Puerto Madryn, Chubut, Argentina.",
  "skills_title": "Habilidades"
}
