{
  "uni": "University Nacional del Sur",
  "uni_desc": "I earned a Bachelor's Degree in Computer Science (comparable to an Australian Bachelor Degree with a Mayor in Computing.), gaining deep theoretical and practical knowledge in software development, data structures, algorithms, artificial intelligence, and distributed systems.",
  "school": "Technical Education College Nº1 “Fray Luis Beltrán”",
  "school_desc": "Graduated as a Technician in Personal and Professional Computing, a hands-on program focused on hardware, basic programming, networks, and technical support.",
  "react": "React & React Native",
  "react_desc": "Completed multiple online courses focused on React and React Native, covering fundamentals, advanced components, and full-stack app development for web and mobile platforms.",
  "wordpress_course": "Wordpress Course",
  "wordpress_course_desc": "I taught an introductory course on WordPress, guiding students on how to build and customize websites using this powerful CMS.",
  "css_course": "HTML, CSS and Javascript Course",
  "css_course_desc": "Led a training session for backend developers at Globant, introducing them to front-end tools and best practices using modern HTML, CSS and JavaScript.",
  "ux_masterclass": "Brisbane Beginners UX Masterclass",
  "ux_masterclass_desc": "Attended a beginner UX course covering the fundamentals of user experience design, including wireframing, user flows, and intuitive interface design.",
  "scipycon": "Artificial intelligence with Python - SciPyCon 2013",
  "scipycon_desc": "Participated in a class at the San Juan Bosco University focused on AI fundamentals using Python.",
  "free_digital": "For a free digital society - By Richard Stallman",
  "free_digital_desc": "Attended an influential talk by Richard Stallman in Bahía Blanca about digital freedom, the GNU project, and the importance of free software.",
  "security": "Computer Security: issues, tools, techniques and working methods",
  "security_desc": "Joined a lecture on computer security that explored tools and practices for protecting systems against modern digital threats.",
  "joomla": "JOOMLA, your website overnight",
  "joomla_desc": "Introductory course to Joomla as a CMS, teaching how to install, manage, and customize themes and content.",
  "gnu_linux": "Introductory Course to the operating system GNU / Linux",
  "gnu_linux_desc": "Attended a beginner-friendly session on using GNU/Linux, including basic commands, directory structure, and open-source philosophy.",
  "spa": "Spanish",
  "spa_desc": "Native",
  "eng": "English",
  "eng_desc": "6 years in “Asociación Argentina de Cultura Inglesa” (1995 - 2001), with a final score of 6. TOEFL IBT exam on January of 2014 with a score of 86. I lived in Australia for a year.",
  "ita": "Italian",
  "ita_desc": "Fluid. Living in Salerno, Italy since 2022"
}
